Repository: crazyyy/hooks
Catalog: wp-plugins/google-drive-cdn/assets/langs/google-drive-cdn-*.po
Languages: de_de

source: Settings
de_de: Einstellungen

source: More Plugins by WPBuddy
de_de: Mehr Plugins von WPBuddy

source: 1. Enable the Drive API
de_de: 1. Drive API aktivieren

source: 2. Connect with your Google Drive
de_de: 2. Mit Google Drive konnektieren

source: 3. Instructions - READ THIS CAREFULLY
de_de: 3. Anleitung - LESE DIES SORGFÄLTIG

source: 4. Settings
de_de: 4. Einstellungen

source: Error Logs, hints and statistics
de_de: Fehlerprotokoll, Hinweise und Statistiken

source: About
de_de: Über

source: Helpful links
de_de: Hilfreiche Links

source: Like this plugin?
de_de: Du magst dieses Plugin?

source: Get our free Newsletter
de_de: Kostenlosen Newsletter abonnieren

source: Local cache has been cleared.
de_de: Lokale Cache wurde gelöscht.

source: All files created by this plugin have been trashed.
de_de: Alle Dateien die durch dieses Plugin erstellt wurden, wurden in den Google Drive Papierkorb verschoben.

source: Google Drive as been disconnected
de_de: Google Drive wurde getrennt

source: Error log has been cleared.
de_de: Das Fehlerprotokoll wurde gelöscht.

source: Sync / Upload started...
de_de: Synchronisation / Upload wurde gestartet...

source: Sync will be stopped after the current file has been uploaded successfully.
de_de: Die Synchronisierung wird abgebrochen nachdem die aktuelle Datei erfolgreich hochgeladen wurde.

source: Google Drive CDN Settings
de_de: Google Drive CDN Einstellungen

source: Google's API returned an error!
de_de: Google's API hat einen Fehler zurückgegeben.

source: Clear CDN cache
de_de: CDN Cache leeren

source: Clear the Google to WordPress CDN cache
de_de: Den Google Drive CDN Cache leeren

source: CDN sync in progress! Click here to stop.
de_de: CDN Synchronisation ist im Gange. Klicke hier um zu stoppen.

source: CDN upload in progress! Click here to stop.
de_de: CDN Upload ist im Gange. Klicke hier um zu stoppen.

source: Stopping CDN sync/upload ...
de_de: CDN Synchronisierung / Upload wird gestoppt ...

source: The Google Drive CDN plugin currently syncs or uploads your items to your Google Drive storage.
de_de: Das Google Drive CDN Plugin synchronisiert im Moment einige Deiner Dateien mit Deinem Google Drive.

source: Once a week
de_de: Einmal pro Woche

source: Every 2th week
de_de: Jede zweite Woche

source: Every 3rd week
de_de: Jede dritte Woche

source: Once a month
de_de: Einmal im Monat

source: First, you need to enable the Drive API for the plugin. You can do this in your app's API project in the Google Cloud Console.
de_de: Zuerst muss die Drive-API aktiviert werden. Diese Einstellung triffst du im Projekt in der Google Cloud Console.

source: <strong>Please note</strong> that Google always tends to change things quickly. They have changed the way to register apps three times in the year 2013. So it can be that the little "How to" below is outdated when you have bought the plugin. In this case, please visit the FAQ page of the plugin to get the latest version of the How-To: %s
de_de: <strong>Bitte beachte folgendes:</strong> Google neigt dazu, Dinge sehr schnell zu verändern. Im Jahr 2013 haben sie den Vorgang, eine App zu registrieren, dreimal geändert. Das bedeutet, dass das kleine "How-To" unten eventuell nicht mehr ganz korrekt ist, wenn Du das Plugin gekauft hast. In diesem Fall kannst Du gerne mal auf unsere FAQ-Seite wechseln. Dort findest du immer die aktuellste Anleitung: %s

source: Google Drive as CDN FAQ page
de_de: Google Drive als CDN FAQ Seite (englisch)

source: You need a Google account. You do not have a Google account? Click here to create one: %s
de_de: Du benötigst ein Google Konto. Wenn Du keines hast, kannst Du hier eines erstellen: %s

source: Create an API project in the Google Cloud Console (former Google API Console) by following this link: %s
de_de: Erstelle ein API-Projekt in Google’s Cloud Console (vorher: „Google API Console“) indem du folgendem Link folgst: %s

source: Click the red "Create Project" button and type in a name (ex. "WordPress to Google Drive") and a project ID (like "wp-to-gd" - should be unique)
de_de: Klicke auf den roten „Create Project“ Button, gib einen Namen (z.B. WordPress Google Drive“) und eine Projekt-ID (z.B. „wp-to-gd“ - sollte einzigartig sein) ein.

source: If done click "APIs & auth" -> "APIs" and activate the "Drive API" and "Drive SDK" (set the switch to ON).
de_de: Fertig? Dann klicke auf „APIs & auth“ -> „APIs“ und aktiviere „Drive API“ und „Drive SDK“ (Schalter auf ON setzen).

source: Then click the "Consent screen" link in the menu.
de_de: Dann klicke auf den „Consent screen“ link im Menü.

source: Type-in a product name (like "WordPress to GoogleDrive").
de_de: Gebe einen Plugin-Namen ein (z.B. „WordPress to Google Drive“).

source: Choose an E-Mail Address and save your settings.
de_de: Wähle eine E-Mail Adresse und speichere Deine Einstellungen.

source: Then click the "APIs & auth" -> "Credentials" link.
de_de: Dann klicke auf „APIs & auth“ -> „Credentials“ im Menü.

source: Click the red button which says "Create New Client ID".
de_de: Klicke auf den roten „Create New Client ID“ Button.

source: Choose "Web application".
de_de: Wähle "Web application".

source: Enter %s in the field "Authorized Javascript origins"
de_de: Gebe %s in das Feld "Authorized Javascript origins" ein.

source: Enter %s in the "Authorized Redirect URI" field
de_de: Gebe %s in das Feld „Authorized Redirect URI“ ein.

source: Then click "Create Client ID".
de_de: Klick auf "Create Client ID".

source: You should now see all the information that are required.
de_de: Du solltest nun alle Daten sehen, die Du benötigst.

source: Copy&Paste the Client ID and the Client Secret in the text fields below.
de_de: Kopiere die Client ID sowie den Client Secret in die unten stehenden Textfelder.

source: Please note: you will be redirected to a Google's authorization page. Please press the blue button to give this application the right to upload files.
de_de: Bitte beachten: Du wirst zunächst auf eine Google-Autorisierungs-Seite geleitet. Klicke dort auf den blauen Button um diesem Plugin das Hochladen von Dateien zu erlauben.

source: Grant writing permissions to your Google Drive
de_de: Gewähre dem Plugin Schreibrechte auf Ihr Google Drive Konto

source: The Google Drive API is currently not working.
de_de: Die Google Drive API scheint im Moment nicht zu funktionieren.

source: Try to (re-)authenticate by using the button "Grant writing permissions to your Google Drive" button.
de_de: Versuche das Plugin erneut mit dem Plugin zu verbinden indem Du auf den Button "Gewähren Sie dem Plugin Schreibrechte auf Ihr Google Drive Konto" klickst.

source: Installation manual
de_de: Installationsanleitung

source: Frequently Asked Questions
de_de: Häufig gestellte Fragen

source: Report a bug
de_de: Einen Fehler melden

source: Request a function
de_de: Eine neue Funktion wünschen

source: Submit a translation
de_de: Eine Übersetzung einreichen

source: More cool stuff by WPBuddy
de_de: Weitere Produkte von WPBuddy

source: Your first name
de_de: Dein Vorname

source: Your E-Mail address
de_de: Deine E-Mail Adresse

source: Subscribe
de_de: Eintragen

source: You are now ready to go! The plugin has created a folder named %1$s on your Google Drive. Click here to view all files: %2$s
de_de: Das Plugin ist fertig eingerichtet! Es hat einen Ordner mit dem Namen %1$s auf Ihrem Google Drive Laufwerk erstellt. Klicke hier um alle Dateien jetzt anzusehen: %2$s

source: The plugin works like this:
de_de: Das Plugin funktioniert folgendermaßen:

source: If anyone visits a page of your website, the plugin searches for files that can be uploaded to Google Drive.
de_de: Wenn irgend jemand eine deiner Seiten besucht beginnt das Plugin nach Dateien zu suchen, die noch nicht zu Deinem Google Drive Laufwerk hochgeladen wurden.

source: If the file is not yet uploaded to Google Drive the plugin will put it down into the cache-database for a later upload.
de_de: Wenn eine Datei noch nicht hochgeladen wurde, wird sie in einer Cache-Datenbank erfasst und für den späteren Upload vorgemerkt.

source: Every hour the plugin reads all these entries from the cache-database to sync files to your Google Drive that have not yet been synced.
de_de: Das Plugin liest stündlich jeden dieser Einträge aus und synchronisiert die Dateien zu Deinem Google Drive Laufwerk, die dort noch nicht hochgeladen wurden.

source: Synced files can then be served directly from your Google Drive.
de_de: Synchronisierte Dateien können direkt von Deinem Google Drive Laufwerk ausgeliefert werden.

source: You can manually start syncing the files that have been written to the cache-database by clicking the "Sync local CDN"-button.
de_de: Du kannst die Synchronisation der Dateien die in der Cache-Datenbank liegen sofort manuell starten indem Du auf den Button "Lokales CDN synchronisieren" drückst.

source: From time to time every single file gets located and uploaded to Google Drive. Because of this process the speed of your website should improve continuously.
de_de: Von Zeit zu Zeit werden immer mehr Dateien zu Deinem Google Drive Laufwerk hochgeladen. Deswegen wird deine Webseite von Zeit zu Zeit immer schnell werden.

source: Please note:
de_de: Bitte beachte folgendes:

source: It is recommended to use a "caching plugin" like WP-Super-Cache to significantly improve page load time.
de_de: Es wird der Einsatz eines "Caching Plugins" wie z.B. WP-Super-Cache empfohlen um die Ladezeit der Website weiter zu verkürzen.

source: You can start sync your local media library to Google Drive using the "Sync my media library now"-button. Depending on the size of your media library this will take some time.
de_de: Du kannst Deine lokale WordPress-Mediathek sofort auf dein Google Drive Laufwerk hochladen indem du auf den Button "Meine Mediathek synchronisieren" drückst. Abhängig von der Größe deiner aktuellen Mediathek kann das einige Zeit in Anspruch nehmen.

source: Google Drive delivers all files via secure SSL. If you are not using SSL on your domain you should remove CSS files from the file extensions field below. This is because it can lead to the "Mixed Content Blocker" problem some browsers have when your CSS file tries to import Non-SSL files via the @import function. The plugin will automatically stop referring to CSS files on Google Drive if it detects that your domain does not support SSL.
de_de: Google Drive liefert alle Dateien über SSL aus. Wenn Du kein SSL auf deiner Domain nutzt solltest du die CSS-Dateierweiterung aus der Liste der Dateierweiterungen unten löschen. Das Plugin muss das so handhaben um die User vor dem so genannten "Mixed Content Blocker" Problem zu bewahren. Einige Browser blockieren z.B. das Nachladen von Dateien in CSS Dateien (über die @import Funktion) wenn die dort aufgerufenen Dateien nicht auch über SSL aufgerufen wird. Das Plugin versucht automatisch herauszufinden ob Du SSL nutzt. Falls nicht, wird CSS deaktiviert.

source: As per default this plugin syncs new or updated files every hour. This can cause problems if you're using a WordPress theme which change files on the file system. Try to manually sync files after changing any theme-related things.
de_de: In der Standardeinstellungen synchronisiert dieses Plugin neue oder veränderte Dateien jede Stunde. Das könnte Probleme mit einigen WordPress Themes verursachen falls diese Dateien auf dem Dateisystem verändern. Versuche einfach, die Synchronisation manuell zu starten, nachdem Du am Theme etwas verändert hast.

source: Statistics
de_de: Statistiken

source: Number of total file entries in the cache database.
de_de: Anzahl der gesamten Einträge in der Datenbank.

source: Number of synced files.
de_de: Anzahl aller synchronisierten Dateien.

source: Number of files that have not yet been synced or can't be synced.
de_de: Anzahl der Dateien die noch nicht hochgeladen wurden oder aber nicht hochgeladen werden können.

source: Date of the next automatic sync/update process.
de_de: Datum des nächsten, automatischen Synchronisierungs- oder Uploadprozesses.

source: Errors & Hints
de_de: Fehler & Hinweise

source: Delete Logs
de_de: Protokoll löschen

source: Purchase Code
de_de: Kaufcode (Purchase Code)

source: Change temp dir
de_de: Temporären Ordner ändern

source: Temp. dir
de_de: Temporärer Ordner

source: IO Method
de_de: IO Methode

source: Only replace every
de_de: Nur jedes

source: Cache time
de_de: Cachezeit

source: Sync / Upload interval
de_de: Synchronisierungs- / Upload-Intervall

source: Never sync / Upload new files only
de_de: Niemals synchronisieren / Nur neue Dateien hochladen

source: File extensions
de_de: Dateierweiterungen

source: Excluded files
de_de: Ausgegrenzte Dateien

source: Actions
de_de: Aktionen

source: file
de_de: Datei hochladen

source: Increasing this number can improve load time because your own server can deliver files, too. Not every single file should be delivered from your Google Drive. It is better to spread them across multiple servers.
de_de: Die Erhöhung dieser Zahl kann die Ladezeit drastisch erhöhen, weil Dein eigener Server ebenfalls Dateien ausliefern kann. Nicht jede einzelne Datei sollte auf dem Google Drive gespeichert werden. Es ist besser, die Dateien auf mehrere Server zu verteilen.

source: hours (It's recommend to leave this empty because static files do not change very often.)
de_de: h (Es wird empfohlen, dieses Feld leer zu lassen weil sich statische Dateien selten ändern).

source: Please specify how long the URLs should be cached. Set to 0 to deactivate. Leave it blank to store the files for an indefinite period.
de_de: Bitte gebe an, wie lange die URLs zwischengespeichert werden sollen. Setze den Wert auf 0 um Caching zu deaktivieren. Lasse das Feld leer, wenn die URLs auf unbestimmte Zeit gespeichert werden sollen.

source: How often the files should be synced. If you have a very large media library you should consider doing this not too often because it will need a lot of resources on your webserver.
de_de: Wie oft die Dateien synchronisiert werden sollen. Wenn Du eine sehr große Mediathek hast solltest Du die Synchronisierung nicht zu oft durchführen, da sehr viele Webserver-Resourcen benötigt werden.

source: File extensions to search for (comma separated). Note that already uploaded files remain in Google Drive if a file extension is removed. Clear your local CDN cache after updating this field.
de_de: Dateierweiterungen nach denen gesucht werden soll (durch Komma getrennt). Bitte beachte, dass bereits hochgeladene Dateien im Google Drive verbleiben falls beispielsweise eine Dateiendung entfernt wird. Leere den lokalen CDN-Cache nachdem Du die Liste der Dateierweiterungen verändert hast.

source: The plugin found out that you are currently not using SSL. To prevent "Mixed Content Blocker" warnings some browsers produce, no CSS files will be used from your Google Drive.
de_de: Das Plugin hat herausgefunden, dass Du im moment kein SSL benutzt. Um so genannte „Mixed Content Blocker“ Warnungen zu unterdrücken werden keine CSS Dateien von Deinem Google Drive ausgeliefert.

source: Add full URLs of files you want to exclude. One per line.
de_de: Füge eine URL einer Datei hinzu, die nicht gecached werden soll. Eine pro Zeile.

source: Activate this if you're getting a "open_basedir restriction in effect" error.
de_de: Aktiviere das Häkchen wenn Du einen "open_basedir Restriktion in effect" Fehler erhälst.

source: Read more about it here. (Question #15)
de_de: Erfahre hier mehr darüber. (Frage 15, englisch)

source: This is the path to a writable folder. Only set when "Change temp dir" is activated.
de_de: Dies ist der Pfad zu Verzeichnis der vom Webserver beschreibbar ist. Ist nur aktiv wenn "Temporärer Ordner ändern" aktiv ist.

source: If you have problems to connect to the Google Drive API you can change the IO Method here. If neither Curl nor HTTP Stream works please ask your hosting provider to activate at least the PHP curl functions.
de_de: Wenn Du Probleme hast das Plugin mit Google Drive zu verbinden, dann ändere die IO (Input/Output) Methode hier. Wenn weder Curl noch HTTP Stream funktioniert, nehme bitte Kontakt zu Deinem Hosting-Provider auf. Er sollte mindestens PHPs Curl-Funktionen aktivieren.

source: In order to get automatic updates you should copy and paste your purchase code here. If you do not know where to get your purchase code, please click here: %s
de_de: Um automatische Update zu erhalten, benötigt das Plugin Ihren Kaufcode (engl. Purchase Code). Wenn Du nicht weißt, wo Du Ihn finden kannst, klicke bitte hier: %s

source: Where to find your purchase code
de_de: Wo finde ich den Purchase Code? (engl.)

source: Disconnect
de_de: Trennen

source: Disconnects your Website from Google Drive. It does not delete any files.
de_de: Trennt Deine Webseite von Deinem Google Drive. Es werden keine Dateien gelöscht.

source: Clear local CDN cache
de_de: Lokalen CDN-Cache leeren

source: Clears the local cache (which means that all links from local to Google Drive files will be lost and the plugin has to fetch it again).
de_de: Leert den aktuellen Cache. Das bedeutet, dass alle Verbindungen der lokalen Dateien zu den Google-Drive Dateien verloren gehen. Das Plugin muss die Dateien dann neu zuordnen.

source: Trash CDN files
de_de: CDN-Dateien in den Papierkorb schieben

source: Moves all cached files to the Google Drive trash. It does not delete any files. You have to delete these files yourself.
de_de: Verschiebt alle Cache-Dateien in den Google-Drive Papierkorb. Es werden keine Dateien gelöscht. Du musst die Dateien selbst vom Papierkorb löschen.

source: Sync local CDN
de_de: Lokales CDN synchronisieren

source: Upload new files
de_de: Neue Dateien hochladen

source: Syncs the local CDN Cache database with your Google Drive folder. Existing files will be updated (if necessary). Files that are not yet on Google Drive will be uploaded.
de_de: Synchronisiert den lokalen CDN-Cache (Datenbank) mit Deinem Google Drive Verzeichnis. Bereits existierende Dateien werden dabei geupdated (falls nötig). Dateien die noch nicht hochgeladen wurden, werden hochgeladen.

source: Sync my media library now
de_de: Meine Mediathek synchronisieren

source: This syncs your media library. Leave this page if you want to stop syncing.
de_de: Synchronisierung Deiner Mediathek. Verlasse die aktuelle Seite, wenn Du die Synchronisierung abbrechen willst.

source: Stop current sync process
de_de: Den aktuellen Synchronisierungsprozess stoppen

source: If this is checked, the plugin will never sync your media library. It will only upload new files that haven't been uploaded yet. Great for very large websites.
de_de: Wenn dies aktiviert wurde, wird die Mediathek nie synchronisiert. Das Plugin wird nur neue Dateien hochladen, die noch nicht hochgeladen wurden. Nützlich für wirklich sehr große Webseiten.

source: You should consider entering you purchase code for the %s plugin because you get every update immediately delivered to your WordPress installation.
de_de: Du solltest darüber nachdenken, deinen Kaufcode (engl. "Purchase Code") für das %s Plugin einzugeben da du automatisch über jedes Update informiert wirst und es direkt über deine WordPress-Installation einbinden kannst.
